# -*- org-use-property-inheritance: t; -*-
#+TITLE: CNCF Demo on Azure
#+AUTHOR: Hippie Hacker
#+EMAIL: hh@ii.coop
#+CREATOR: ii.coop
#+DATE: March 1st, 2017
#+PROPERTY: header-args :dir "."
#+NOTPROPERTY: header-args:shell :prologue ". .env_prod ; . ~/.rvm/scripts/rvm"
#+PROPERTY: header-args:shell :session none :exports both :cache yes
** manually

#+NAME: run az via docker
#+BEGIN_SRC
docker run -v $(pwd)/.azure:/root/.azure azuresdk/azure-cli-python az account list -o table
#+END_SRC

#+NAME: az account list
#+BEGIN_SRC shell
az account list -o table
az account set --subscription Pay-As-You-Go
#+END_SRC

#+RESULTS[eb0d69eb1ea1b9a005604b3dd37889127d19f76b]: az account list
| Name          | CloudName   | SubscriptionId                       | State                                | IsDefault   |
| ------------- | ----------- | ------------------------------------ | --------                             | ----------- |
| Free          | Trial       | AzureCloud                           | 5358e673-95e7-4cd8-9791-ca28dd5e3cbb | Disabled    |
| Pay-As-You-Go | AzureCloud  | 70693672-7c0d-485f-ac08-06d458c80f0e | Enabled                              | True        |

#+NAME: az account show table
#+BEGIN_SRC shell :results output verbatim raw
az account show -o table
#+END_SRC

#+RESULTS[00afff595364da643372e54234a45a775c1539ef]: az account show table
| EnvironmentName   | IsDefault   | Name          | State   | TenantId                             |
| ----------------- | ----------- | ------------- | ------- | ------------------------------------ |
| AzureCloud        | True        | Pay-As-You-Go | Enabled | 9996322a-93ac-43ae-80be-887a3e8194a1 |

#+NAME: az_account_show_json
#+HEADERS: :wrap SRC js
#+HEADERS: :results output
#+BEGIN_SRC shell :export both
az account show
#+END_SRC

#+RESULTS[97a6b7ba7839519d9223a4e67e27ced7ed78f0b9]: az_account_show_json
#+BEGIN_SRC js
{
  "environmentName": "AzureCloud",
  "id": "70693672-7c0d-485f-ac08-06d458c80f0e",
  "isDefault": true,
  "name": "Pay-As-You-Go",
  "state": "Enabled",
  "tenantId": "9996322a-93ac-43ae-80be-887a3e8194a1",
  "user": {
    "name": "azure@ii.coop",
    "type": "user"
  }
}
#+END_SRC

#+NAME: generate ENV
#+BEGIN_SRC shell
ARM_SUBSCRIPTION_ID=$( az account show | jq -r .id )
CREDS_JSON=$( az ad sp create-for-rbac --name cncfdemos )
ARM_TENANT_ID=$( echo ${CREDS_JSON} | jq -r .tenant )
ARM_CLIENT_ID=$( echo ${CREDS_JSON} | jq -r .appId )
ARM_CLIENT_SECRET=$( echo ${CREDS_JSON} | jq -r .password )
echo export ARM_SUBSCRIPTION_ID=$ARM_SUBSCRIPTION_ID
echo export ARM_TENANT_ID=$ARM_TENANT_ID
echo export ARM_CLIENT_ID=$ARM_CLIENT_ID
echo export ARM_CLIENT_SECRET=$ARM_CLIENT_SECRET
#+END_SRC

# Local Variables:
# eval: (require (quote ob-shell))
# eval: (require (quote ob-lisp))
# eval: (require (quote ob-js))
# eval: (org-babel-do-load-languages 'org-babel-load-languages '((js . t) (shell . t)))
# eval: (setenv "PATH" (concat (concat (getenv "HOME") "/bin:") (getenv "PATH") ))
# End:
